In [1]:
#list of list
import pandas as pd

l1=[[11,22,33],[44,55,66],[77,88,99]]
df1=pd.DataFrame(l1)
df1

    0   1   2
0  11  22  33
1  44  55  66
2  77  88  99

In [2]:
#dict of list
d={
    'amzn':[300,400,500,600],
    'tsla':[122,567,897,456],
    'goog':[657,453,789,890],
}
df2=pd.DataFrame(d)
df2

   amzn  tsla  goog
0   300   122   657
1   400   567   453
2   500   897   789
3   600   456   890

In [3]:
#list of dict
d1=[{'open':100,'high':500,'low':789,'close':765},
    {'open':67,'high':789,'low':789,'close':765},
    {'open':100,'high':500,'low':789,'close':765}]
df3=pd.DataFrame(d1)
df3

   open  high  low  close
0   100   500  789    765
1    67   789  789    765
2   100   500  789    765

In [4]:
import numpy as np
np1=np.arange(25).reshape(5,5)
df4=pd.DataFrame(np1,columns=['c1','c2','c3','c4','c5'],index=['r1','r2','r3','r4','r5'])
df4

    c1  c2  c3  c4  c5
r1   0   1   2   3   4
r2   5   6   7   8   9
r3  10  11  12  13  14
r4  15  16  17  18  19
r5  20  21  22  23  24

In [5]:
df5=pd.read_csv(r'/Users/algo trading 2025/batch34/11_data analysis/sp500.csv')
df5

                           Name                  Sector   Price    EPS
0                     Apple Inc  Information Technology  170.12   9.20
1                    Abbvie Inc             Health Care   93.29   5.31
2           Abbott Laboratories             Health Care   55.28   2.41
3                 Accenture Plc  Information Technology  145.30   5.91
4                  Allergan Plc             Health Care  171.81  15.42
..                          ...                     ...     ...    ...
97   Verizon Communications Inc      Telecommunications   45.85   3.75
98     Walgreens Boots Alliance        Consumer Staples   70.25   5.10
99        Wells Fargo & Company              Financials   54.02   4.14
100             Wal-Mart Stores        Consumer Staples   96.08   4.36
101            Exxon Mobil Corp                  Energy   80.31   3.56

[102 rows x 4 columns]

In [6]:
!pip install openpyxl

Requirement already satisfied: openpyxl in /Users/algo trading 2025/batch34/.venv/lib/python3.12/site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in /Users/algo trading 2025/batch34/.venv/lib/python3.12/site-packages (from openpyxl) (2.0.0)

In [7]:
df6=pd.read_excel('nov-9.xlsx')
df6

     name  age country
0  akshay   59   india
1    matt   36      uk

In [8]:
!pip install lxml

Requirement already satisfied: lxml in /Users/algo trading 2025/batch34/.venv/lib/python3.12/site-packages (6.0.2)

In [51]:
data1=pd.read_html('https://www.screener.in/screens/281185/nifty-50/')[0]
data1

,S.No.,Name,CMP Rs.,P/E,Mar Cap Rs.Cr.,Div Yld %,NP Qtr Rs.Cr.,Qtr Profit Var %,Sales Qtr Rs.Cr.,Qtr Sales Var %,ROCE %
0,1.,Reliance Industr,1518.90,26.82,2055446.70,0.36,22092.00,9.67,254623.00,9.97,9.69
1,2.,HDFC Bank,989.60,21.03,1521677.59,1.11,20363.77,10.01,86993.84,4.81,7.51
2,3.,Bharti Airtel,2100.70,39.13,1259903.13,0.76,8650.80,65.11,52145.40,25.73,13.48
3,4.,TCS,3106.00,22.35,1123777.98,1.93,12131.00,8.54,65799.00,2.40,64.63
4,5.,ICICI Bank,1373.00,18.41,981160.51,0.80,14318.15,3.16,48180.91,4.00,7.87
5,6.,SBI,967.85,11.37,893385.32,1.64,21860.59,-4.25,128040.50,5.78,6.47
6,7.,Bajaj Finance,1018.50,34.63,633759.78,0.43,4947.76,21.89,20178.90,18.06,11.35
7,8.,Infosys,1502.80,22.20,624323.43,2.86,7375.00,13.19,44490.00,8.55,37.50
8,9.,Life Insurance,909.45,11.26,575226.92,1.32,10095.92,30.66,241524.29,4.50,53.13
9,10.,Hind. Unilever,2427.70,53.92,570410.27,1.77,2694.00,-2.14,16241.00,1.98,27.85
10,11.,Larsen & Toubro,4004.40,34.27,550837.60,0.85,4678.01,15.63,67983.53,10.44,14.49
11,12.,ITC,408.15,25.35,511323.69,3.52,5186.55,2.91,19501.63,-2.44,36.79
12,13.,Maruti Suzuki,15684.00,33.36,493109.00,0.86,3349.00,7.95,42344.20,13.07,21.70
13,14.,M & M,3698.60,32.32,459931.57,0.68,3963.75,15.85,46105.67,21.57,13.93
14,15.,HCL Technologies,1594.60,25.49,432721.04,3.39,4236.00,0.00,31942.00,10.67,31.61
15,S.No.,Name,CMP Rs.,P/E,Mar Cap Rs.Cr.,Div Yld %,NP Qtr Rs.Cr.,Qtr Profit Var %,Sales Qtr Rs.Cr.,Qtr Sales Var %,ROCE %
16,16.,Sun Pharma.Inds.,1757.10,36.52,421587.15,0.91,3124.95,2.56,14478.31,8.93,20.21
17,17.,Kotak Mah. Bank,2079.70,22.27,413575.40,0.12,4468.27,-11.42,17198.74,4.70,8.17
18,18.,Axis Bank,1241.60,14.83,385332.49,0.08,5566.56,-25.31,32309.77,2.24,7.11
19,19.,UltraTech Cem.,11874.00,47.70,349902.05,0.65,1237.98,75.23,19606.93,20.33,10.89
20,20.,Titan Company,3829.20,82.33,339951.08,0.29,1120.00,59.09,18725.00,28.84,19.14
21,21.,Bajaj Finserv,2065.80,34.10,330076.25,0.05,4746.47,7.53,37402.93,10.98,11.03
22,22.,Adani Ports,1512.70,27.23,326764.22,0.46,3120.20,25.07,9167.46,29.72,13.80
23,23.,NTPC,328.45,13.41,318487.00,2.54,5225.30,-3.94,44785.82,0.18,9.95
24,24.,Hind.Aeronautics,4729.80,37.35,316317.20,0.85,1669.05,10.82,6628.61,10.92,33.88
25,25.,Bharat Electron,426.85,54.78,312017.91,0.56,1287.16,17.88,5792.09,25.78,38.88

In [10]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 102 entries, 0 to 101
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    102 non-null    object
 1   Sector  102 non-null    object
 2   Price   102 non-null    float64
 3   EPS     102 non-null    float64
dtypes: float64(2), object(2)
memory usage: 3.3+ KB

In [11]:
print(df5.head())
df5.tail(5)

                  Name                  Sector   Price    EPS
0            Apple Inc  Information Technology  170.12   9.20
1           Abbvie Inc             Health Care   93.29   5.31
2  Abbott Laboratories             Health Care   55.28   2.41
3        Accenture Plc  Information Technology  145.30   5.91
4         Allergan Plc             Health Care  171.81  15.42

                           Name              Sector  Price   EPS
97   Verizon Communications Inc  Telecommunications  45.85  3.75
98     Walgreens Boots Alliance    Consumer Staples  70.25  5.10
99        Wells Fargo & Company          Financials  54.02  4.14
100             Wal-Mart Stores    Consumer Staples  96.08  4.36
101            Exxon Mobil Corp              Energy  80.31  3.56

In [12]:
df5.describe()

             Price         EPS
count   102.000000  102.000000
mean    150.500686    6.485294
std     240.768463    8.577741
min      12.110000    0.020000
25%      54.335000    2.885000
50%      88.295000    4.405000
75%     151.032500    6.565000
max    1762.230000   74.450000

In [13]:
df5.shape

(102, 4)

In [14]:
list(df5.columns)

['Name', 'Sector', 'Price', 'EPS']

In [15]:
df5

                           Name                  Sector   Price    EPS
0                     Apple Inc  Information Technology  170.12   9.20
1                    Abbvie Inc             Health Care   93.29   5.31
2           Abbott Laboratories             Health Care   55.28   2.41
3                 Accenture Plc  Information Technology  145.30   5.91
4                  Allergan Plc             Health Care  171.81  15.42
..                          ...                     ...     ...    ...
97   Verizon Communications Inc      Telecommunications   45.85   3.75
98     Walgreens Boots Alliance        Consumer Staples   70.25   5.10
99        Wells Fargo & Company              Financials   54.02   4.14
100             Wal-Mart Stores        Consumer Staples   96.08   4.36
101            Exxon Mobil Corp                  Energy   80.31   3.56

[102 rows x 4 columns]

In [16]:
df5.index

RangeIndex(start=0, stop=102, step=1)

In [17]:
df5.Sector

0      Information Technology
1                 Health Care
2                 Health Care
3      Information Technology
4                 Health Care
                ...
97         Telecommunications
98           Consumer Staples
99                 Financials
100          Consumer Staples
101                    Energy
Name: Sector, Length: 102, dtype: object

In [18]:
df5['Sector']

0      Information Technology
1                 Health Care
2                 Health Care
3      Information Technology
4                 Health Care
                ...
97         Telecommunications
98           Consumer Staples
99                 Financials
100          Consumer Staples
101                    Energy
Name: Sector, Length: 102, dtype: object

In [23]:
df5[df5['Price']>100]
df5[df5['EPS']>10]

                               Name                  Sector    Price    EPS
4                      Allergan Plc             Health Care   171.81  15.42
7                             Amgen             Health Care   168.93  12.58
12                       Biogen Inc             Health Care   311.92  21.59
14                        Blackrock              Financials   474.05  21.55
37                       Fedex Corp             Industrials   217.75  11.91
40            General Dynamics Corp             Industrials   198.70  10.07
44                 Alphabet Class C  Information Technology  1018.48  29.87
45                 Alphabet Class A  Information Technology  1034.09  29.87
46              Goldman Sachs Group              Financials   238.05  19.20
50  International Business Machines  Information Technology   151.40  13.66
58             Lockheed Martin Corp             Industrials   312.93  12.72
75                  Priceline Group  Consumer Discretionary  1762.23  74.45

In [30]:
a=df5['Price']>1000
a
b=df5['EPS']>10
df5[a & b]

                Name                  Sector    Price    EPS
44  Alphabet Class C  Information Technology  1018.48  29.87
45  Alphabet Class A  Information Technology  1034.09  29.87
75   Priceline Group  Consumer Discretionary  1762.23  74.45

In [ ]:
df5[['Name','Sector']]
#single column is called series
#multiple columns is called dataframe

                           Name                  Sector
0                     Apple Inc  Information Technology
1                    Abbvie Inc             Health Care
2           Abbott Laboratories             Health Care
3                 Accenture Plc  Information Technology
4                  Allergan Plc             Health Care
..                          ...                     ...
97   Verizon Communications Inc      Telecommunications
98     Walgreens Boots Alliance        Consumer Staples
99        Wells Fargo & Company              Financials
100             Wal-Mart Stores        Consumer Staples
101            Exxon Mobil Corp                  Energy

[102 rows x 2 columns]

In [ ]:
df5=df5.set_index('Name')
# df5.set_index('Name',inplace=True)

In [48]:
df5

      Price                  Sector    EPS
0    170.12  Information Technology   9.20
1     93.29             Health Care   5.31
2     55.28             Health Care   2.41
3    145.30  Information Technology   5.91
4    171.81             Health Care  15.42
..      ...                     ...    ...
97    45.85      Telecommunications   3.75
98    70.25        Consumer Staples   5.10
99    54.02              Financials   4.14
100   96.08        Consumer Staples   4.36
101   80.31                  Energy   3.56

[102 rows x 3 columns]

In [43]:
df5.set_index('Price',inplace=True)

In [47]:
df5=df5.reset_index()